Revit 2027 API
BuiltInFailures.RebarFailures.MaxHookExtensionMultiplierWarn Property
 The allowable range of values for the Rebar Hook Extension Multiplier is from 0.01 to 99.0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MaxHookExtensionMultiplierWarn { get; }
Public Shared ReadOnly Property MaxHookExtensionMultiplierWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MaxHookExtensionMultiplierWarn {
	FailureDefinitionId^ get ();
}
static member MaxHookExtensionMultiplierWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace